---
kind: property
id: P:Autodesk.Revit.DB.ReferencePoint.Name
source: html/ce62ef45-46cc-6fe7-ffcc-1578c16f8d6b.htm
---
# Autodesk.Revit.DB.ReferencePoint.Name Property

## Syntax (C#)
```csharp
public override string Name { get; set; }
```